---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeSettings.IsValidSpecificFittingAngle(System.Double)
source: html/ca0d771a-33e9-f073-083b-098d4d74e924.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.IsValidSpecificFittingAngle Method

Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.

## Syntax (C#)
```csharp
public bool IsValidSpecificFittingAngle(
	double angle
)
```

## Parameters
- **angle** (`System.Double`) - The angle value (in degree).

## Returns
True if the given value is a valid specific fitting angle.